#!/usr/bin/env bash
clear
cat << EOF
Моля изберете:

    1. Покажи настоящия потребител
    2. Пожажи наличната операционна памет
    3. Провери дали дадена директория е гит хранилище
    4. Генерирай рандомизирана парола
    5. Покажи настоящия час
    6. Покажи системна информация
    7. Покажи дисково пространство
    8. Покажи дисково използване
    9. Покажи информация за процесора
    0. Затвори

EOF
echo -n 'Enter selection [0-9]: '
read -r sel

case $sel in
	0) echo "Програмата е затворена";;
    # принтираме системната променлива $USER
	1) echo "$USER";;
    # Показване на количеството свободна и използвана памет в системата чрез командатаа free
    2) free -m ;;
    3)
        echo -n 'Въведи директория: '
        # четем път
        read directory
        cd $directory
        
        #запазваме команда за проверка дали е гит хранилище
        inside_git_repo="$(git rev-parse --is-inside-work-tree 2>/dev/null)"

        # проверка дали е гит хранилище
        if [ "$inside_git_repo" ]; then
            echo "пътя $directory е git хранилище"
        else
            echo "пътя $directory не е git хранилище"
        fi

        cd -
        ;;
    4) 
        # Използваме OpenSSL което е инструмент за криптография свързан със
        # създаване и управление на частни ключове, публични ключове и параметри

        echo -n 'Въведете дължината: '
        read -r num
        openssl rand -hex $num
        ;;
    5)
        # Показване на датата в даден формат като използваме %T за часа
        date +"%T"
        ;;
    6) 
        # Показване на текущото време, колко време системата работи, колко потребители са влезли в момента
        uptime;;
	7)
        # df показва количеството налично дисково пространство във файловата система
        df -h;;
	8) 
        # du показва обобщеното използване на диска.
		if [ "$UID" = 0 ]; then
			echo "Дисково използване (Всички юзъри)"
			du -sh /home/*
		else
			echo "Дисково използване ($USER)"
			du -sh "$HOME"
		fi
	;;
    9)
        cat /proc/cpuinfo
    ;;  
	*)
		echo "Невалидно число" >&2
		exit 1
esac